# Pandas

In [1]:
import pandas as pd

In [2]:
#Creating Series
ser = pd.Series(['Mon','Tues','Wed','Thurs'])
print(ser)

0      Mon
1     Tues
2      Wed
3    Thurs
dtype: object

In [3]:
data = [1,2,3,4,5]
label = ['Mon','Tues','Wed','Thurs','Fri']
ser1 = pd.Series(data,label)
ser1

Mon      1
Tues     2
Wed      3
Thurs    4
Fri      5
dtype: int64

In [5]:
#Series = (Data, label)
series1 = pd.Series([5,12,23,14],['Mon','Wed','Thur','Fri'])
#print(series1)

#Series = (Data, label)
series2 = pd.Series([15,10,3],['Mon','Thur','Tue'])
#print(series2)

#Arithmetic operations series
series3 = series1+series2
print(series3)
print(type(series3))

Fri      NaN
Mon     20.0
Thur    33.0
Tue      NaN
Wed      NaN
dtype: float64
<class 'pandas.core.series.Series'>

In [6]:
#Creating data frames from list
list1 = ["welcome","to","Data","science"]
label = ["w1","w2","w3","w4"]
df1 = pd.DataFrame(list1,label)
df1

          0
w1  welcome
w2       to
w3     Data
w4  science

In [8]:
#Create data frames from dictionary
index1 = ['Emp1','Emp2','Emp3','Emp4','Emp5','Emp6','Emp7','Emp8']
data = {'Name':['Anu','Anshu','Adhish','Anup','Adhin','Adhira','Adara','Adhi'],
       'Age':[37,43,28,31,28,51,53,39],
       'Location':['Chennai','Bangalore','Bangalore','Bangalore','Chennai','Bangalore','Chennai','Chennai'],
       'Department':['HR','Testing','Training','HR','HR','Dev','Testing','Testing'],
       'Salary':[40000,29000,42000,38000,27000,33000,35000,41000]}
df = pd.DataFrame(data,index1)
print(df)
print(type(df))

      Age Department   Location    Name  Salary
Emp1   37         HR    Chennai     Anu   40000
Emp2   43    Testing  Bangalore   Anshu   29000
Emp3   28   Training  Bangalore  Adhish   42000
Emp4   31         HR  Bangalore    Anup   38000
Emp5   28         HR    Chennai   Adhin   27000
Emp6   51        Dev  Bangalore  Adhira   33000
Emp7   53    Testing    Chennai   Adara   35000
Emp8   39    Testing    Chennai    Adhi   41000
<class 'pandas.core.frame.DataFrame'>

In [10]:
df1 = pd.read_csv('NewEmp.csv')
print(df1)
print(type(df1))

  Unnamed: 0 Name     Address  Age         Dept   Domain    Basic      HRA  \
0       Emp1    X   Bengaluru   40           HR       HR  25000.0   7500.0
1       Emp2    Y      Mumbai   50  IT Services      PSS  45000.0  13500.0
2       Emp3    Z     Chennai   45     Products  Product  35000.0  10500.0
3       Emp4    G   Hyderabad   55     Strategy  Product  50000.0  15000.0
4       Emp5    U       China   27  IT Services      PSS  32000.0   9600.0
5       Emp6    W   Singapore   35  IT Services      PSS  28000.0   8400.0
6       Emp7    R  California   21  IT Services      PSS  31000.0   9300.0
7       Emp8    S       Tokyo   42     Products  Product  41000.0  12300.0
8       Emp9    O    Malaysia   52     Strategy  Product  54000.0  16200.0
9      Emp10    L     Houston   37  IT Services      PSS  60000.0  18000.0

        DA       GP
0   5000.0  37500.0
1   9000.0  67500.0
2   7000.0  52500.0
3  10000.0  75000.0
4   6400.0  48000.0
5   5600.0  42000.0
6   6200.0  46500.0
7   8200.0  61500.0
8  10800.0  81000.0
9  12000.0  90000.0
<class 'pandas.core.frame.DataFrame'>

In [3]:
df2 = pd.read_excel('Default_bank.xlsx')
df2

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","November 7, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","November 12, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","November 7, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [17]:
df1.head(3)

,Unnamed: 0,Name,Address,Age,Dept,Domain,Basic,HRA,DA,GP
0,Emp1,X,Bengaluru,40,HR,HR,25000.0,7500.0,5000.0,37500.0
1,Emp2,Y,Mumbai,50,IT Services,PSS,45000.0,13500.0,9000.0,67500.0
2,Emp3,Z,Chennai,45,Products,Product,35000.0,10500.0,7000.0,52500.0

In [20]:
df1.tail(2)

,Unnamed: 0,Name,Address,Age,Dept,Domain,Basic,HRA,DA,GP
8,Emp9,O,Malaysia,52,Strategy,Product,54000.0,16200.0,10800.0,81000.0
9,Emp10,L,Houston,37,IT Services,PSS,60000.0,18000.0,12000.0,90000.0

In [22]:
#Create data frames from dictionary
index1 = ['Emp1','Emp2','Emp3','Emp4','Emp5','Emp6','Emp7','Emp8']
data = {'Name':['Anu','Anshu','Adhish','Anup','Adhin','Adhira','Adara','Adhi'],
       'Age':[37,43,28,31,28,51,53,39],
       'Location':['Chennai','Bangalore','Bangalore','Bangalore','Chennai','Bangalore','Chennai','Chennai'],
       'Department':['HR','Testing','Training','HR','HR','Dev','Testing','Testing'],
       'Salary':[40000,29000,42000,38000,27000,33000,35000,41000]}
df = pd.DataFrame(data,index1)
print(df)
print(type(df))

      Age Department   Location    Name  Salary
Emp1   37         HR    Chennai     Anu   40000
Emp2   43    Testing  Bangalore   Anshu   29000
Emp3   28   Training  Bangalore  Adhish   42000
Emp4   31         HR  Bangalore    Anup   38000
Emp5   28         HR    Chennai   Adhin   27000
Emp6   51        Dev  Bangalore  Adhira   33000
Emp7   53    Testing    Chennai   Adara   35000
Emp8   39    Testing    Chennai    Adhi   41000
<class 'pandas.core.frame.DataFrame'>

In [21]:
df.head()

      Age Department   Location    Name  Salary
Emp1   37         HR    Chennai     Anu   40000
Emp2   43    Testing  Bangalore   Anshu   29000
Emp3   28   Training  Bangalore  Adhish   42000
Emp4   31         HR  Bangalore    Anup   38000
Emp5   28         HR    Chennai   Adhin   27000

In [23]:
df.tail(2)

      Age Department Location   Name  Salary
Emp7   53    Testing  Chennai  Adara   35000
Emp8   39    Testing  Chennai   Adhi   41000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, Emp1 to Emp8
Data columns (total 5 columns):
Age           8 non-null int64
Department    8 non-null object
Location      8 non-null object
Name          8 non-null object
Salary        8 non-null int64
dtypes: int64(2), object(3)
memory usage: 384.0+ bytes

In [26]:
df.describe()

             Age        Salary
count   8.000000      8.000000
mean   38.750000  35625.000000
std     9.750458   5604.526232
min    28.000000  27000.000000
25%    30.250000  32000.000000
50%    38.000000  36500.000000
75%    45.000000  40250.000000
max    53.000000  42000.000000

In [25]:
df.columns

Index(['Age', 'Department', 'Location', 'Name', 'Salary'], dtype='object')

In [28]:
df['Department']

Emp1          HR
Emp2     Testing
Emp3    Training
Emp4          HR
Emp5          HR
Emp6         Dev
Emp7     Testing
Emp8     Testing
Name: Department, dtype: object

In [32]:
df[['Age','Salary']]

      Age  Salary
Emp1   37   40000
Emp2   43   29000
Emp3   28   42000
Emp4   31   38000
Emp5   28   27000
Emp6   51   33000
Emp7   53   35000
Emp8   39   41000

In [33]:
df.rename(columns={'Salary':'BasicSalary','Department':'Dept'})

      Age      Dept   Location    Name  BasicSalary
Emp1   37        HR    Chennai     Anu        40000
Emp2   43   Testing  Bangalore   Anshu        29000
Emp3   28  Training  Bangalore  Adhish        42000
Emp4   31        HR  Bangalore    Anup        38000
Emp5   28        HR    Chennai   Adhin        27000
Emp6   51       Dev  Bangalore  Adhira        33000
Emp7   53   Testing    Chennai   Adara        35000
Emp8   39   Testing    Chennai    Adhi        41000

In [34]:
df

      Age Department   Location    Name  Salary
Emp1   37         HR    Chennai     Anu   40000
Emp2   43    Testing  Bangalore   Anshu   29000
Emp3   28   Training  Bangalore  Adhish   42000
Emp4   31         HR  Bangalore    Anup   38000
Emp5   28         HR    Chennai   Adhin   27000
Emp6   51        Dev  Bangalore  Adhira   33000
Emp7   53    Testing    Chennai   Adara   35000
Emp8   39    Testing    Chennai    Adhi   41000

In [35]:
df.rename(columns={'Salary':'BasicSalary','Department':'Dept'},inplace=True)

In [36]:
df

      Age      Dept   Location    Name  BasicSalary
Emp1   37        HR    Chennai     Anu        40000
Emp2   43   Testing  Bangalore   Anshu        29000
Emp3   28  Training  Bangalore  Adhish        42000
Emp4   31        HR  Bangalore    Anup        38000
Emp5   28        HR    Chennai   Adhin        27000
Emp6   51       Dev  Bangalore  Adhira        33000
Emp7   53   Testing    Chennai   Adara        35000
Emp8   39   Testing    Chennai    Adhi        41000

In [37]:
df2 = df2[['Name','Dept','Age','Location','Salary']]
df2

        Name      Dept  Age   Location  BasicSalary
Emp1     Anu        HR   37    Chennai        40000
Emp2   Anshu   Testing   43  Bangalore        29000
Emp3  Adhish  Training   28  Bangalore        42000
Emp4    Anup        HR   31  Bangalore        38000
Emp5   Adhin        HR   28    Chennai        27000
Emp6  Adhira       Dev   51  Bangalore        33000
Emp7   Adara   Testing   53    Chennai        35000
Emp8    Adhi   Testing   39    Chennai        41000

In [38]:
df['HRA']=0.3*df.BasicSalary

C:\Users\1613287\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [39]:
df

        Name      Dept  Age   Location  BasicSalary      HRA
Emp1     Anu        HR   37    Chennai        40000  12000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0
Emp7   Adara   Testing   53    Chennai        35000  10500.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0

In [40]:
df.loc['Emp3']

Name              Adhish
Dept            Training
Age                   28
Location       Bangalore
BasicSalary        42000
HRA                12600
Name: Emp3, dtype: object

In [41]:
df.loc[['Emp3','Emp5']]

        Name      Dept  Age   Location  BasicSalary      HRA
Emp3  Adhish  Training   28  Bangalore        42000  12600.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0

In [42]:
df['BasicSalary']

Emp1    40000
Emp2    29000
Emp3    42000
Emp4    38000
Emp5    27000
Emp6    33000
Emp7    35000
Emp8    41000
Name: BasicSalary, dtype: int64

In [43]:
df

        Name      Dept  Age   Location  BasicSalary      HRA
Emp1     Anu        HR   37    Chennai        40000  12000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0
Emp7   Adara   Testing   53    Chennai        35000  10500.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0

In [46]:
df.iloc[[3]]
df.iloc[[3],[2]]
df.iloc[[1,4],[2,4]]

      Age  BasicSalary
Emp2   43        29000
Emp5   28        27000

In [49]:
df.loc['Emp5','BasicSalary']
df.loc[['Emp5'],['Name','Dept']]

       Name Dept
Emp5  Adhin   HR

In [54]:
df[(df.Age>30)&(df.BasicSalary>=40000)]

      Name     Dept  Age Location  BasicSalary      HRA
Emp1   Anu       HR   37  Chennai        40000  12000.0
Emp8  Adhi  Testing   39  Chennai        41000  12300.0

In [55]:
df['DA']=0.1*df.BasicSalary
df['GA']=df.BasicSalary+df.HRA+df.DA

C:\Users\1613287\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\1613287\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [56]:
df

        Name      Dept  Age   Location  BasicSalary      HRA      DA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  4000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  2900.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  4200.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  3800.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  2700.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  3300.0  46200.0
Emp7   Adara   Testing   53    Chennai        35000  10500.0  3500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  4100.0  57400.0

In [57]:
df[(df.Age >=35)]

        Name     Dept  Age   Location  BasicSalary      HRA      DA       GA
Emp1     Anu       HR   37    Chennai        40000  12000.0  4000.0  56000.0
Emp2   Anshu  Testing   43  Bangalore        29000   8700.0  2900.0  40600.0
Emp6  Adhira      Dev   51  Bangalore        33000   9900.0  3300.0  46200.0
Emp7   Adara  Testing   53    Chennai        35000  10500.0  3500.0  49000.0
Emp8    Adhi  Testing   39    Chennai        41000  12300.0  4100.0  57400.0

In [59]:
df[(df.Age >=35)& (df.Dept == 'HR')]

     Name Dept  Age Location  BasicSalary      HRA      DA       GA
Emp1  Anu   HR   37  Chennai        40000  12000.0  4000.0  56000.0

In [61]:
df[(df.Age >=35)& (df.Dept == 'HR')][['Name','Location']]

     Name Location
Emp1  Anu  Chennai

In [62]:
df

        Name      Dept  Age   Location  BasicSalary      HRA      DA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  4000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  2900.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  4200.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  3800.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  2700.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  3300.0  46200.0
Emp7   Adara   Testing   53    Chennai        35000  10500.0  3500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  4100.0  57400.0

In [63]:
df.loc[df['Age'] > 51, 'Dept'] = "Dev"
df

C:\Users\1613287\AppData\Roaming\Python\Python36\site-packages\pandas\core\indexing.py:517: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

        Name      Dept  Age   Location  BasicSalary      HRA      DA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  4000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  2900.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  4200.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  3800.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  2700.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  3300.0  46200.0
Emp7   Adara       Dev   53    Chennai        35000  10500.0  3500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  4100.0  57400.0

In [64]:
df[(df.Dept == 'Testing')][['BasicSalary','GA']].mean()

BasicSalary    35000.0
GA             49000.0
dtype: float64

In [65]:
df[(df.Age>=35)][['BasicSalary','DA','GA']].max()

BasicSalary    41000.0
DA              4100.0
GA             57400.0
dtype: float64

In [68]:
df_table = df.pivot_table(index = 'Dept')
df_table

          Age  BasicSalary      DA       GA      HRA
Dept
Dev        52        34000  3400.0  47600.0  10200.0
HR         32        35000  3500.0  49000.0  10500.0
Testing    41        35000  3500.0  49000.0  10500.0
Training   28        42000  4200.0  58800.0  12600.0

In [69]:
df_table.to_csv('test5.csv')

In [71]:
df.drop('DA', axis=1)

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp7   Adara       Dev   53    Chennai        35000  10500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [72]:
df

        Name      Dept  Age   Location  BasicSalary      HRA      DA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  4000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  2900.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  4200.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  3800.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  2700.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  3300.0  46200.0
Emp7   Adara       Dev   53    Chennai        35000  10500.0  3500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  4100.0  57400.0

In [73]:
df.drop('DA', axis=1, inplace = True)

C:\Users\1613287\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [74]:
df

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp7   Adara       Dev   53    Chennai        35000  10500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [75]:
df.drop('Emp7', axis=0)

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [76]:
df

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp7   Adara       Dev   53    Chennai        35000  10500.0  49000.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [77]:
df.drop('Emp7', axis=0, inplace=True)

C:\Users\1613287\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [78]:
df

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [80]:
index_names = df[ (df['Age'] >= 51)].index 
print(index_names)
df.drop(index_names)

Index(['Emp6'], dtype='object')

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [81]:
df

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [82]:
dfNew = df

In [83]:
df

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [84]:
dfNew

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [85]:
dfConcat = pd.concat([df,dfNew])
dfConcat

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [86]:
#Horizontal Concatenation
lastHDF = pd.concat([df,dfNew],axis=1)
lastHDF

,Name,Dept,Age,Location,BasicSalary,HRA,GA,Name,Dept,Age,Location,BasicSalary,HRA,GA
Emp1,Anu,HR,37,Chennai,40000,12000.0,56000.0,Anu,HR,37,Chennai,40000,12000.0,56000.0
Emp2,Anshu,Testing,43,Bangalore,29000,8700.0,40600.0,Anshu,Testing,43,Bangalore,29000,8700.0,40600.0
Emp3,Adhish,Training,28,Bangalore,42000,12600.0,58800.0,Adhish,Training,28,Bangalore,42000,12600.0,58800.0
Emp4,Anup,HR,31,Bangalore,38000,11400.0,53200.0,Anup,HR,31,Bangalore,38000,11400.0,53200.0
Emp5,Adhin,HR,28,Chennai,27000,8100.0,37800.0,Adhin,HR,28,Chennai,27000,8100.0,37800.0
Emp6,Adhira,Dev,51,Bangalore,33000,9900.0,46200.0,Adhira,Dev,51,Bangalore,33000,9900.0,46200.0
Emp8,Adhi,Testing,39,Chennai,41000,12300.0,57400.0,Adhi,Testing,39,Chennai,41000,12300.0,57400.0

In [87]:
df.reset_index()

  index    Name      Dept  Age   Location  BasicSalary      HRA       GA
0  Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
1  Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
2  Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
3  Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
4  Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
5  Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
6  Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [88]:
df

        Name      Dept  Age   Location  BasicSalary      HRA       GA
Emp1     Anu        HR   37    Chennai        40000  12000.0  56000.0
Emp2   Anshu   Testing   43  Bangalore        29000   8700.0  40600.0
Emp3  Adhish  Training   28  Bangalore        42000  12600.0  58800.0
Emp4    Anup        HR   31  Bangalore        38000  11400.0  53200.0
Emp5   Adhin        HR   28    Chennai        27000   8100.0  37800.0
Emp6  Adhira       Dev   51  Bangalore        33000   9900.0  46200.0
Emp8    Adhi   Testing   39    Chennai        41000  12300.0  57400.0

In [89]:
df3 = pd.read_csv('test5.csv')
df3

       Dept  Age  BasicSalary      DA       GA      HRA
0       Dev   52        34000  3400.0  47600.0  10200.0
1        HR   32        35000  3500.0  49000.0  10500.0
2   Testing   41        35000  3500.0  49000.0  10500.0
3  Training   28        42000  4200.0  58800.0  12600.0

In [90]:
df3

       Dept  Age  BasicSalary      DA       GA      HRA
0       Dev   52        34000  3400.0  47600.0  10200.0
1        HR   32        35000  3500.0  49000.0  10500.0
2   Testing   41        35000  3500.0  49000.0  10500.0
3  Training   28        42000  4200.0  58800.0  12600.0

In [92]:
df3.set_index('Age')

         Dept  BasicSalary      DA       GA      HRA
Age
52        Dev        34000  3400.0  47600.0  10200.0
32         HR        35000  3500.0  49000.0  10500.0
41    Testing        35000  3500.0  49000.0  10500.0
28   Training        42000  4200.0  58800.0  12600.0